我叫张学良 众人称呼我为少帅<br>
成绩霸学堂 请勿为我大惊小怪<br>
六子的成绩 勇气 需硝烟向大帅呈递<br>
怎会惧碰壁 山海关大旗仍立<br>
曾记武堂里恩师谆谆教诲<br>
河风将梦敲碎 相对面子弹交飞<br>
祸起皇姑屯站 父亲死于非命<br>
草草收起悲哀痛楚 尝试不失去威信<br>
舅姨叔嫂 为利益一番胡搅<br>
名曰前来赴吊，争相将局势主导。<br>
沉默着改了生日，纵泪将眼眸充斥。<br>
从此承袭家业独将东北统治<br><br>

怀仇恨奉承父亲遗志 坚决反对内战<br>
克众怨促成东北易帜 试止中华溃乱<br>
将蒋中正拥护 出兵中东路 与苏对战<br>
奈何他庸碌 蠢俗 违誓言讲我背叛<br>
中原又陷混乱 十几路军阀率兵混战<br>
惜国家前途昏暗 战区百姓肝肠寸断<br>
自问可失魂胆 竟无视万民哭喊<br>
拍一封电报 救震旦 才是我的本愿<br><br>

柳条湖火起 可总座命我容忍<br>
白日旗堕地 使我见日寇凶狠<br>
一味地躲避 怎可担卫国重任<br>
安静着坐毙 我只得气没声吞<br><br>

总座命令我坚决地执行不抵抗<br>
幻想只是挑衅 但现实给我当头一棒<br>
士兵眼前死亡 岂能不心胸激荡<br>
弃了锦州失了热河 只剩满目凄怆<br>
希望 西方世界有未来中国的依仗<br>
促膝长谈 我窥见赤旗将来大好气象<br>
旧中国掩不住的颓势 此刻欲盖弥彰<br>
救亡图存道路漫长 待人挈领提纲<br><br>

那个冬天 为国家与杨将军共勉<br>
纵千种凶险 即使被后人万般痛贬<br>
眼前事胜于雄辩 雨骤难以成眠<br>
我心志众目共见 决意要发动政变<br>
华清池旁 抓蒋委员长 逼他翻墙<br>
月色微凉 骊山洞中隐藏 今夜漫长<br>
那睡衣赛跑的冠军 嘲笑里声名远扬<br>
这拱手让土的元勋 跑本就是他专长<br><br>

要联共抗日 外侮应优先于家事<br>
负千钧众志 我行事何须人来夸饰<br>
一致地对外 救国于危殆 扶势于催败<br>
我不懈的努力让国共同仇敌忾<br><br>

我登上飞机 自知已没了归期<br>
不自禁追忆 辽河飞溢的水汽<br>
无论伟逸或卑鄙 当我脚与地面接触<br>
无论功过如何评说 少帅的一生就此结束<br><br>

北投的窗户前 向外极目眺望<br>
笼中鸟般暮年 也难灭一腔豪放<br>
英雄或罪人 只不过复杂人生表象<br>
何必愁眉苦脸 终都只余一幅肖像<br>

